## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.AzureFunction.azurerm_role_assignment.func_access_to_kv will be created
  + resource "azurerm_role_assignment" "func_access_to_kv" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e1af2e9-d805-45c6-80e9-be08d6b6fccf"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.KeyVault/vaults/kv-ecowitt-test-euw-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.AzureFunction.azurerm_storage_account.fapp-data will be updated in-place
  ~ resource "azurerm_storage_account" "fapp-data" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittdatatesteuw01"
      ~ local_user_enabled                 = true -> false
        name                               = "saecowittdatatesteuw01"
        tags                               = {}
        # (94 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.AzureFunction.azurerm_storage_account.fapp-operational will be updated in-place
  ~ resource "azurerm_storage_account" "fapp-operational" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Storage/storageAccounts/saecowittfunctesteuw01"
      ~ local_user_enabled                 = true -> false
        name                               = "saecowittfunctesteuw01"
        tags                               = {}
        # (94 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.AzureFunction.azurerm_windows_function_app.fapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "fapp" {
      ~ app_settings                                   = {
          + "KV_NAME"                                  = "kv-ecowitt-test-euw-01"
            # (3 unchanged elements hidden)
        }
        id                                             = "/subscriptions/5782fb3c-e93b-4920-8f22-6b2038fbfa9f/resourceGroups/rg-ecowitt-test-euw/providers/Microsoft.Web/sites/fa-ecowitt-test-euw"
        name                                           = "fa-ecowitt-test-euw"
        tags                                           = {}
        # (32 unchanged attributes hidden)

      ~ site_config {
          + ip_restriction_default_action          = "Allow"
          ~ remote_debugging_enabled               = false -> true
          + remote_debugging_version               = "VS2022"
          + scm_ip_restriction_default_action      = "Allow"
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>